{"class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_21", "dtype": "int32", "output_dim": 300, "trainable": true, "embeddings_regularizer": null, "input_dim": 6787, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 56], "activity_regularizer": null, "input_length": 56}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_22", "dtype": "int32", "output_dim": 200, "trainable": true, "embeddings_regularizer": null, "input_dim": 6787, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 56], "activity_regularizer": null, "input_length": 56}}]}], "name": "merge_22", "concat_axis": -1, "arguments": {}, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "mode": "concat"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "batch_input_shape": [null, 56, 500], "trainable": true, "name": "dropout_21", "rate": 0.5}}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 56, 500], "name": "input_11", "sparse": false}, "name": "input_11"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_91", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_91"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_94", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4]}, "name": "conv1d_94"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_97", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "name": "conv1d_97"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_91", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_91", "pool_size": [2]}, "name": "max_pooling1d_91"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_94", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_94", "pool_size": [2]}, "name": "max_pooling1d_94"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_97", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_97", "pool_size": [2]}, "name": "max_pooling1d_97"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_91", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_92", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_92"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_94", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_95", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4]}, "name": "conv1d_95"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_97", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_98", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "name": "conv1d_98"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_92", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_92", "pool_size": [2]}, "name": "max_pooling1d_92"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_95", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_95", "pool_size": [2]}, "name": "max_pooling1d_95"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_98", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_98", "pool_size": [2]}, "name": "max_pooling1d_98"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_92", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_93", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_93"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_95", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_96", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4]}, "name": "conv1d_96"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_98", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_99", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "name": "conv1d_99"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_93", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_93", "pool_size": [2]}, "name": "max_pooling1d_93"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_96", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_96", "pool_size": [2]}, "name": "max_pooling1d_96"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_99", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_99", "pool_size": [2]}, "name": "max_pooling1d_99"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_93", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_31"}, "name": "flatten_31"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_96", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_32"}, "name": "flatten_32"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_99", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_33"}, "name": "flatten_33"}, {"class_name": "Merge", "inbound_nodes": [[["flatten_31", 0, 0, {}], ["flatten_32", 0, 0, {}], ["flatten_33", 0, 0, {}]]], "config": {"name": "merge_21", "concat_axis": -1, "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "output_shape": null, "mode": "concat"}, "name": "merge_21"}], "input_layers": [["input_11", 0, 0]], "name": "model_11", "output_layers": [["merge_21", 0, 0]]}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 150, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_22"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}}], "backend": "tensorflow"}